#include "common.h"

/*定义一个有符号短整数变量shortsmall，并赋值为shortsmall = 32767，++两次，每次++输出结果，并观察现象。
 * 短整数16个二进制位
 *  无符号unsigned，16位都是数值位
 *      16位存储的最大数值，二进制1111111111111111 = 2的16次方 - 1 = 十进制65535
 *  有符号signed，即第1位是符号位，后面15位是数值位
 *      15位能存储的最大数值，二进制111111111111111 = 2的15次方 - 1 = 十进制32767
 *      符号位0表示正数 0111111111111111 = +32767
 *      符号位1表示负数 1000000000000000 = 0111111111111111 + 1 = -32768
 *                    1000000000000001 = 1000000000000000 + 1 = -32767
 *      可以把符号位，看作是一个带符号属性的数值位，即符号位的值 = 符号 * 该位数值
 *      整个数 = 符号位的值 + 后面各数值位的值
 *          比如数1000000000000000
 *              符号位的1的值是：1 * 2的15次方 * 符号属性（-） = -32768
 *              后面位都是0，所以整个数的值就是-32768
 *          又如1000000000000001
 *              符号位的1的值是：1 * 2的15次方 * 符号属性（-） = -32768
 *              后面最低位是1，所以整个数的值就是-32768 + 1 = -32767
*/
void a26_test()
{
    LOG2;
    signed short shortsmall = 32766; //short shortsmall = 32766;
    LOG2 << shortsmall;

    ++shortsmall;   //32767
    LOG2 << shortsmall;

    ++shortsmall;   //-32768
    LOG2 << shortsmall;

    ++shortsmall;   //-32767
    LOG2 << shortsmall;
}
